app/Http/Controllers/Customer/HomeController.php

    public function index()
    {
        $products = Product::with(['product_category'])
            ->orderBy('created_at', 'desc')
            ->take(8)
            ->get();
---
select * from `product_categories` where `product_categories`.`id` in (36, 37, 38, 39, 40, 41, 42, 43)
select * from `products` order by `created_at` desc limit 8