app/Http/Controllers/Customer/ProductController.php

select * from `product_categories` where `product_categories`.`id` in (16)
---
    public function detail($slug)
    {
        $product = product::with(['product_category'])->where('slug', $slug)->first();