app/Http/Controllers/Customer/ProductController.php

    public function detail($slug)
    {
        $product = Product::with(['product_category'])->where('slug', $slug)->first();
---
select * from `products` where `slug` = 'harum-error-ut-nostrum' limit 1