app/View/Components/Customers/Cart.php

select count(distinct `product_id`) as aggregate from `carts` where `user_id` = 41
---
    public function render(): View|Closure|string
    {
        $count = ModelsCart::where('user_id', Auth::user()->id)
        ->distinct('product_id')
        ->count();