app/View/Components/Customers/FilterCategory.php

select * from `product_categories`
---
    public function render(): View|Closure|string
    {
        $categories = ProductCategory::all();