app/Http/Controllers/HomeController.php

select * from `product_categories` where `product_categories`.`id` in (11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
---
    public function products(Request $request)
    {
        $products = Product::with(['product_category'])->where('product_category_id', $request->category_id)->get();
        $products = Product::with(['product_category'])
            ->when($request->category_id != "", function ($q) use ($request) {
                $q->where('product_category_id', $request->category_id);
            })->get();