app/Http/Controllers/HomeController.php

    public function beranda()
    {
        $users = Cache::remember('users', 60, function () {
            return User::all();
---
select * from `users`